Repository: FisherRone/AutoPlan
Catalog: AutoPlan/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# @猫猫 刚收到通知，下周三之前要把客户满意度调查结果整理成Excel发给我，记得加上环比数据。还有那个合同扫描件也尽快传一下，谢啦。
source: @Cat, I just got a notice — please compile the customer satisfaction survey results into an Excel file and send it to me by next Wednesday, and don't forget to include the month-over-month data. Also, please upload the scanned copy of the contract as soon as you can. Thanks!
zh_hans: @猫猫 刚收到通知，下周三之前要把客户满意度调查结果整理成Excel发给我，记得加上环比数据。还有那个合同扫描件也尽快传一下，谢啦。
zh_hant: @貓貓 剛收到通知，下星期三之前要把客戶滿意度調查結果整理成Excel檔傳給我，記得加上環比數據。還有那份合約掃描檔也麻煩盡快上傳一下，謝啦。

source: # USER_INSTRUCTION {{USER_INSTRUCTION}} # Priority of Rules BASE_INSTRUCTION > USER_INSTRUCTION > Rules ## Rules ## Output language for title and note fields Must be the same as the user's input language. ## Rule: Multi-Task Processing - If input contains multiple tasks, extract each of them to a JSON object separately, return all objects in one JSON array. - Example: "Meeting at 9 AM tomorrow, visit client at 2 PM, gym at 7 PM" should generate an array containing three objects. - If a reminder belongs to another event or all-day item, it is recommended to place it in the title or note of that event/all-day item, not as a separate item. ## Rules for filling the "type" field - event: Occurs at a specific point in time or time period, requires punctual participation, not a time window or deadline. E.g., "grab tickets at 10 o'clock", "meeting 9-11 AM" - all-day: Has a definite date, no specific time, and the content can be understood as a day-long "state" or "attribute". - Examples: travel plan / business trip / vacation / industry summit / birthday / holiday / shopping festival / anniversary. - reminder: Has one or more of the following characteristics: - No definite date or time. - Time window. - Has a deadline or cutoff time. - Has a definite date but no time, and cannot be classified as all-day. E.g., "buy groceries on Friday", "meeting tomorrow". Definition of "time window": 1. Has start_time and end_time, and the end_time is a deadline. 2. User does not need to participate throughout; just needs to complete an activity within the window. - Examples: "The recommendation plan will be implemented from Nov 3 to Nov 9", "Registration open from 10 AM today to 24:00 the day after tomorrow", "Start booking after the 10th" ## Rules for filling time fields 1. **Priority for inferring time, reference time selection**: - Priority 1 Context time: time information in the input that is close to the text of the pending item. - Priority 2 Current time. The current time merely represents when the user initiated the request. 2. For relative times like "day of the week" or "next Monday/Tuesday", use relative format extensions. 3. **Exact date vs. fuzzy time period**: a. Exact date: Cases that can be precisely mapped to a specific day on the calendar (e.g., "15th", "next Wednesday", "last day of this month"). -> Handling: Fill in start_time / end_time / reminder_time (depends on type). b. Fuzzy time period: Refers to a range where the exact day cannot be determined (e.g., "end of month", "next week"), or there are multiple optional windows. -> Handling: type: "reminder"; reminder_time: leave empty. c. Fuzzy deadline: e.g., "complete before the end of the month", "deadline at month end", "complete within this week". -> Handling: type: "reminder"; set reminder_time to the last day of that period. d. Exact deadline time for reminder_time: "before tonight" -> 23:59 today; "before the 24th" -> "YY-MM-24" (date only). e. Time window (only one). -> Handling: type: "reminder"; set reminder_time to the deadline, if none, set to the start time. - **Always keep the fuzzy time description in the title** (e.g., "prepare for event at month end", "revise thesis this week"). 4. **end_time**: Leave empty if cannot be determined. 5. Unless the time can be specified to the hour, do not fill in HH:MM. ## Ignore "non-action" verbs - Ignore "non-action" verbs such as: "confirm", "reply received", "forward", "remind someone", "organize mobilization", etc. - Extract what truly needs to be recorded. - Example: "Please ensure all departments notify students... Applications for no-grade-point request open on Nov 26, 2025" ➡️ ignore "ensure notifications", extract "applications open for no-grade-point request" ## Other fields - **title**: Word count < 20. - Do not include anything already present in other fields. - Include the object of the action (if any), e.g., "send email" ➡️ "send email to xx" - **notes**: For lists, long descriptions, other background info. Word count < 100. - Use line breaks, subheadings, numbered lists (1.) etc. to improve readability. - Plain text, no markdown. - **url**: If the app name is known, fill it in. Example: "Tencent Meeting: 200-211-245" #### Current Time {{CURRENT_TIME}} #### Available Lists {{LISTS}} #### Available Tags {{TAGS}}
zh_hans: # 规则的优先级 BASE_INSTRUCTION > USER_INSTRUCTION > Rules # 规则 ## 输出时 title note 字段的语言 必须和用户输入的语言相同。 ## 规则：多任务处理 - 如果输入包含多个任务，则将每个任务分别提取为一个 JSON 对象，并将所有对象以 JSON 数组形式返回。 - 示例：“明天上午9点开会，下午2点去见客户，晚上7点健身” 应生成包含三个对象的数组。 - 如果某个提醒属于另一个事件或全天事项，建议将其放入该事件或全天事项的标题或备注中，不单独建立事项。 ## 类型字段的填写规则 - 事件：在特定时间点或时间段发生，需准时参与，不属于窗口期或截止时间。如“10点抢票”、“9-11点开会”。 - 全天事项：有确定的日期，无具体时间，且内容可理解为一天的“状态”或“属性”。 - 示例：旅行计划/出差/休假/行业峰会/生日/节日/购物节/纪念日。 - 提醒：具有以下一个或多个特点。 - 无明确的日期或时间。 - 窗口期。 - 有截止日期或时间。 - 有确定日期但没有时间，且不能归属于全天事项。如“周五买菜”、“明天开会”。 “窗口期”的定义： 1. 有开始时间和结束时间，且结束时间是截止时间。 2. 用户无需全程参与，只需在窗口期内择期完成某件活动。 - 示例：“推优计划将于11.3-11.9落实”、“今天10点到后天24点开放报名”、“10号后开始预约” ## 各时间字段的填写规则 1. **推断时间时，基准时间选取的优先级**： - 优先级1 上下文时间：输入中离待处理的事项文本最近的时间信息。 - 优先级2 当前时间。当前时间仅代表用户发起请求的时间。 2. 涉及“星期几”“下周星期几”等相对时间的填写：使用相对格式扩展。 3. **确切日期 vs 模糊时段**： a. 确切日期：能精确映射到日历上具体某一天的情况（如“15号”、“下周三”、“本月最后一天”）。 -> 处理：填入开始时间/结束时间/提醒时间。（取决于类型） b. 模糊时段：指代一个范围且无法确定具体哪一天（如“月底”、“下周”），或者有多个可选的窗口期。 -> 处理：类型：“提醒”；提醒时间：留空 c. 模糊的截止日期：如“月底**前**完成”、“月底**截止**”、“本周**内**完成” -> 处理：类型：“提醒”；将该时段的最后一天设为提醒时间。 d. 确切的截止时间的提醒时间：“今晚前” -> 今天23:59；“24号前”->“YY-MM-24”（只写日期） e. 窗口期（仅一个）。 -> 处理：类型：“提醒”；提醒时间设为截止时间，若无，设为开启时间。 - **务必将模糊时间描述保留在标题中**（例：“月底准备活动”、“本周改好论文”） 4. **结束时间**：若无法确定，则留空。 5. 除非时间可具体到小时，否则不填写 HH:MM ## 忽略“虚”的动作 - 忽略“虚”的动作，如：“确认”、“回复收到”、“转发”、“提醒别人”、“组织动员”等。 - 提取那些真正需要记录的事情。 - 如“请各院系做好学生通知工作... 2025年11月26日开放不计绩点申请” ➡️ 忽略“做好学生通知工作”，提取“开放不计绩点申请” ## 其他字段的填写 - **标题**：字数 < 20。 - 不要包含其他字段已有的内容。 - 放入动作的对象（若有），如“发邮件” ➡️ “发邮件给xx” - **备注**：放入清单、长描述、其他背景信息。字数 < 100 - 可用换行符、小标题、数字序号（1.）等方式组织内容，提升易读性。 - 纯文本，不使用 Markdown - **链接**：若知道 App 名称，需填写。示例：“腾讯会议: 200-211-245” #### 当前时间 {{CURRENT_TIME}} #### 可用清单 {{LISTS}} #### 可用标签 {{TAGS}}
zh_hant: {{BASE_INSTRUCTION}} # USER_INSTRUCTION {{USER_INSTRUCTION}} # 規則的優先級 BASE_INSTRUCTION > USER_INSTRUCTION > Rules ## Rules ## 輸出時 title note 欄位的語言 必須與使用者輸入的語言相同。 ## Rule: 多任務處理 - 若輸入內容包含多個任務，請將每個任務分別提取為一個 JSON 物件，並以 JSON 陣列回傳所有物件。 - 範例：「明天上午9點開會，下午2點去見客戶，晚上7點健身」應產生包含三個物件的陣列。 - 若某個 reminder 屬於另一個 event 或 all-day，建議將其放入 event 或 all-day 的 title 或 note 中，不要建立獨立事項。 ## type 欄位的填寫規則 - event：在特定時間點或時間段發生，需準時參與，不屬於窗口期或截止期限。例如：「10 點搶票」、「9-11 點開會」 - all-day：有確定的日期，無具體時間，且內容可理解為一天的「狀態」或「屬性」。 - 範例：旅行計劃 / 出差 / 休假 / 行業峰會 / 生日 / 節日 / 購物節 / 紀念日。 - reminder：具有以下一個或多個特點： - 無明確的日期或時間。 - 窗口期。 - 有截止日期或時間。 - 有確定日期但沒有時間，且不能歸屬於 all-day。例如：「週五買菜」、「明天開會」。 「窗口期」的定義： 1. 具有開始時間與結束時間，且結束時間是一個截止期限。 2. 使用者無需全程參與，只需在窗口期內擇期完成某項活動。 - 範例：「推優計劃將於 11.3-11.9 落實」、「今天 10 點到後天 24 點開放報名」、「10 號後開始預約」 ## 各時間欄位的填寫規則 1. **推斷時間時，基準時間選取的優先級**： - 優先級 1 上下文時間：輸入內容中，距離待處理事項文字較近的時間資訊。 - 優先級 2 當前時間。當前時間僅代表使用者發起請求的時間。 2. 涉及「星期幾」、「下週星際幾」等相對時間的填寫：使用相對格式擴充。 3. **確切日期 vs 模糊時段**： a. 確切日期：能精確映射到日曆上具體某一天的情況（如「15號」、「下週三」、「本月最後一天」）。 -> 處理：填入 start_time / end_time / reminder_time（取決於 type） b. 模糊時段：指一個範圍且無法確定具體哪一天（如「月底」、「下週」），或者有多個可選的窗口期。 -> 處理：type: "reminder"; reminder_time: 留空 c. 模糊的截止日期：如「月底**前**完成」、「月底**截止**」、「本週**內**完成」 -> 處理：type: "reminder"; 將該時段的最後一天設為 reminder_time。 d. 確切的截止時間的 reminder_time：「今晚前」 -> 今天 23:59；「24號前」 -> "YY-MM-24"（只填日期） e. 窗口期（僅一個）。 -> 處理：type: "reminder"; reminder_time 設為截止時間，若無則設為開始時間。 - **務必將模糊時間描述保留在 title 中**（例如：「月底準備活動」、「本週改好論文」） 4. **end_time**：若無法確定，則留空。 5. 除非時間可具體到小時，否則不填寫 HH:MM ## 忽略「虛」的動作 - 忽略「虛」的動作，如：「確認」、「回覆收到」、「轉發」、「提醒別人」、「組織動員」等。 - 提取那些真正需要記錄的事情。 - 例如：「請各院系做好學生通知工作... 2025年11月26日開放不計績點申請」 ➡️ 忽略「做好學生通知工作」，提取「開放不計績點申請」 ## 其他欄位的填寫 - **title**：字數 < 20 - 不要包含已存在於其他欄位的內容 - 放入動作的對象（若有），如「發郵件」 ➡️ 「發郵件給 xx」 - **notes**：放入清單、長描述、其他背景資訊。字數 < 100 - 可用換行符、小標題、數字序號 (1.) 等方式組織內容，提升易讀性。 - 純文字，不使用 Markdown - url：若知道 App 名稱，需填寫。範例：「騰訊會議: 200-211-245」 #### 當前時間 {{CURRENT_TIME}} #### 可用的清單 {{LISTS}} #### 可用的標籤 {{TAGS}}

# %lld 条保存失败
source: Failed to save %lld events.
zh_hans: %lld 条保存失败
zh_hant: %lld 條儲存失敗

# 1. 截图保存至剪贴板，或复制文本到剪贴板
source: 1. Take a screenshot to clipboard, or copy text to the clipboard.
zh_hans: 1. 截图保存至剪贴板，或复制文本到剪贴板
zh_hant: 1. 截圖儲存至剪貼板，或複製文字到剪貼板

# 2. 点击菜单栏上的 App 图标
source: 2. Click the app icon in the menu bar.
zh_hans: 2. 点击菜单栏上的 App 图标
zh_hant: 2. 點擊選單列上的 App 圖示

# 3. 点击“从剪贴板提取日程”
source: 3. Click “Extract schedule from clipboard”.
zh_hans: 3. 点击“从剪贴板提取日程”
zh_hant: 3. 點擊「從剪貼板擷取行程」

# AI 未返回有效内容
source: AI returned no valid content
zh_hans: AI 未返回有效内容
zh_hant: AI 未回傳有效內容

# AI 返回格式异常，请重试
source: AI returned abnormal format, please try again.
zh_hans: AI 返回格式异常，请重试
zh_hant: AI 回傳格式異常，請重試

# API Key 平台网页链接
source: API Key Platform URL
zh_hans: API Key 平台网页链接
zh_hant: API Key 平台網頁連結

# API Key 无效或已过期
source: API Key is invalid or expired.
zh_hans: API Key 无效或已过期
zh_hant: API Key 無效或已過期

# Base URL 中不可以包含 "/chat/completions"
source: Base URL must not contain "/chat/completions"
zh_hans: Base URL 中不可以包含 "/chat/completions"
zh_hant: Base URL 中不可以包含 "/chat/completions"

source: LLM Providers
zh_hans: LLM 服务商
zh_hant: LLM 服務商

# Logo 保存失败
source: Failed to save logo.
zh_hans: Logo 保存失败
zh_hant: Logo 儲存失敗

# Logo 文件无法保存，但服务商配置已保存成功。
source: Unable to save logo file, but service provider configuration was saved successfully.
zh_hans: Logo 文件无法保存，但服务商配置已保存成功。
zh_hant: Logo 檔案無法儲存，但服務商配置已儲存成功。

# OCR 处理失败: %@
source: OCR processing failed: %@
zh_hans: OCR 处理失败: %@
zh_hant: OCR 處理失敗: %@

# 为已有服务商添加新模型
source: Add a new model to an existing provider
zh_hans: 为已有服务商添加新模型
zh_hant: 為已有服務商加入新模型

source: Read from BaseInstruction.txt or user-customized prompt file. Defines the LLM's core role and task description. **Example of actual filled content**: ``` You are a smart schedule assistant. The input is a message received by the user, who wants to record the events or reminders in this message. Your task: Analyze the user's input and intent, extract events or reminders, and output them in the JSON list (Array) format defined below. # Output Field Definitions (structure of each object in the JSON list) ## Required fields - title: String. - type: String. "event" | "all-day" | "reminder" ## Optional fields - start_time: String? - YYYY-MM-DD HH:MM (only for event) - YYYY-MM-DD (only for all-day) - end_time: String? - YYYY-MM-DD HH:MM (only for event) - YYYY-MM-DD (only for all-day) - reminder_time: String? (only for reminder) YYYY-MM-DD HH:MM or YYYY-MM-DD - url: String? (meeting links, meeting IDs, or web URLs) - location: String? - list: String? The list the object belongs to, must be selected from the options given later. ... # Output Format 1. Strict JSON only. No explanatory text. 2. Must wrap in a JSON array [ ]. 3. Return the JSON array directly, without any explanation or description. ```
zh_hans: 从 BaseInstruction.txt 或用户自定义提示词文件读取。定义 LLM 的核心角色和任务说明。 **实际填充内容示例**： ``` 你是一个智能日程助理。 输入的内容是用户收到的一条信息，该用户想要记录该信息中的日程或提醒事项。 你的任务：分析用户的输入和意图，提取日程或提醒事项。并输出为符合以下定义的 JSON 列表 (Array) 格式。 # 输出字段定义 (JSON列表中每个对象的结构) ## 必填项 - title: String. - type: String. "event" | "all-day" | "reminder" ## 可选项 - start_time: String? - YYYY-MM-DD HH:MM (only for event) - YYYY-MM-DD (only for all-day) - end_time: String? - YYYY-MM-DD HH:MM (only for event) - YYYY-MM-DD (only for all-day) - reminder_time: String?（only for reminder）YYYY-MM-DD HH:MM 或 YYYY-MM-DD - url: String? (meeting links, meeting IDs, or web URLs) - location: String? - list: String? 对象所属的列表，必须从之后给定的选项中选择。 ... # Output Format 1. Strict JSON only. No explanatory text. 2. Must wrap in a JSON array [ ]. 3. 直接返回 JSON 数组，不做任何解释或说明。 ```
zh_hant: 從 BaseInstruction.txt 或使用者自訂提示詞檔案讀取。定義 LLM 的核心角色和任務說明。 **實際填充內容範例**： ``` 你是一個智慧行程助理。 輸入的內容是使用者收到的一則訊息，該使用者想要記錄該訊息中的行程或提醒事項。 你的任務：分析使用者的輸入和意圖，擷取行程或提醒事項。並輸出為符合以下定義的 JSON 列表 (Array) 格式。 # 輸出欄位定義 (JSON列表中每個物件的結構) ## 必填項 - title: String. - type: String. "event" | "all-day" | "reminder" ## 可選項 - start_time: String? - YYYY-MM-DD HH:MM (only for event) - YYYY-MM-DD (only for all-day) - end_time: String? - YYYY-MM-DD HH:MM (only for event) - YYYY-MM-DD (only for all-day) - reminder_time: String?（only for reminder）YYYY-MM-DD HH:MM 或 YYYY-MM-DD - url: String? (meeting links, meeting IDs, or web URLs) - location: String? - list: String? 物件所屬的列表，必須從之後給定的選項中選擇。 ... # Output Format 1. Strict JSON only. No explanatory text. 2. Must wrap in a JSON array [ ]. 3. 直接回傳 JSON 陣列，不做任何解釋或說明。 ```

source: All unique tags extracted from calendars. The LLM selects appropriate tags from these to fill the `tags` field. **Example of actual filled content**: ``` ["Work", "Life", "Important", "Meeting"] Select matching items from the list above for the 'tags' field. If none match, leave it blank. ```
zh_hans: 从日历中提取的所有唯一标签。 LLM 从中选择合适的标签填入 `tags` 字段。 **实际填充内容示例**： ``` ["工作", "生活", "重要", "会议"] Select matching items from the list above for the 'tags' field. If none match, leave it blank. ```
zh_hant: 從行事曆中擷取的所有唯一標籤。 LLM 從中選擇合適的標籤填入 `tags` 欄位。 **實際填充內容範例**： ``` ["工作", "生活", "重要", "會議"] Select matching items from the list above for the 'tags' field. If none match, leave it blank. ```

source: A date-weekday mapping table for 15 days before and after the current date. Helps the LLM convert relative times like "Monday", "next Wednesday" into exact dates. **Example of actual filled content**: ``` 2026-05-09 Saturday 2026-05-10 Sunday 2026-05-11 Monday ... 2026-05-23 Friday 2026-05-24 Saturday(current request) 2026-05-25 Sunday ... 2026-06-08 Monday ```
zh_hans: 以当前日期为中心的前后 15 天日期-星期映射表。帮助 LLM 将"星期几"、"下周三"等相对时间转换为准确日期。 **实际填充内容示例**： ``` 2026-05-09 星期六 2026-05-10 星期日 2026-05-11 星期一 ... 2026-05-23 星期五 2026-05-24 星期六(current request) 2026-05-25 星期日 ... 2026-06-08 星期一 ```
zh_hant: 以當前日期為中心的前後 15 天日期-星期映射表。幫助 LLM 將「星期幾」、「下週三」等相對時間轉換為準確日期。 **實際填充內容範例**： ``` 2026-05-09 星期六 2026-05-10 星期日 2026-05-11 星期一 ... 2026-05-23 星期五 2026-05-24 星期六(current request) 2026-05-25 星期日 ... 2026-06-08 星期一 ```

# 使用帮助
source: Help
zh_hans: 使用帮助
zh_hant: 使用說明

# 保存
source: Save
zh_hans: 保存
zh_hant: 儲存

# 保存「%@」失败
source: Failed to save:「%@」
zh_hans: 保存「%@」失败
zh_hant: 儲存「%@」失敗

# 保存事项失败: %@
source: Failed to save item: %@
zh_hans: 保存事项失败: %@
zh_hant: 儲存事項失敗: %@

# 关于
source: About
zh_hans: 关于
zh_hant: 關於

# 关闭
source: Close
zh_hans: 关闭
zh_hant: 關閉

# 列表管理
source: Lists
zh_hans: 列表管理
zh_hant: 列表管理

# 删除
source: Delete
zh_hans: 删除
zh_hant: 刪除

# 删除服务商
source: Delete Provider
zh_hans: 删除服务商
zh_hant: 刪除服務商

# 删除模型
source: Delete Model
zh_hans: 删除模型
zh_hant: 刪除模型

# 刷新失败，请检查日历权限
source: Refresh failed, please check calendar permissions.
zh_hans: 刷新失败，请检查日历权限
zh_hant: 重新整理失敗，請檢查行事曆權限

# 占位符说明
source: Variables
zh_hans: 占位符说明
zh_hant: 佔位符說明

# 取消
source: Cancel
zh_hans: 取消
zh_hant: 取消

# 可用的日历和提醒事项列表
source: Available calendar and reminder lists
zh_hans: 可用的日历和提醒事项列表
zh_hant: 可用的行事曆和提醒事項列表

# 可用的标签列表
source: Available tags list
zh_hans: 可用的标签列表
zh_hant: 可用的標籤列表

# 同名列表
source: List of duplicate names
zh_hans: 同名列表
zh_hant: 同名列表

# 周一
source: Monday
zh_hans: 周一
zh_hant: 週一

# 周日
source: Sunday
zh_hans: 周日
zh_hant: 週日

# 图片中未识别到文字
source: No text found in image.
zh_hans: 图片中未识别到文字
zh_hant: 圖片中未識別到文字

# 在现有提示词的基础之上施加额外的规则。
source: Apply additional rules on top of the existing prompt.
zh_hans: 在现有提示词的基础之上施加额外的规则。
zh_hant: 在現有提示詞的基礎之上施加額外的規則。

# 基础指令内容
source: Base instruction content
zh_hans: 基础指令内容
zh_hant: 基礎指令內容

# 好
source: OK
zh_hans: 好
zh_hant: 好

# 好的
source: OK
zh_hans: 好的
zh_hant: 好的

# 如何提取日程
source: How to extract events?
zh_hans: 如何提取日程
zh_hant: 如何擷取行程

# 存在同名列表，保存时将自动选择其中一个。
source: Duplicate list names detected. Only one of them will be used.
zh_hans: 存在同名列表，保存时将自动选择其中一个。
zh_hant: 存在同名列表，儲存時將自動選擇其中一個。

# 完成
source: Done
zh_hans: 完成
zh_hant: 完成

# 已保存 %lld 条日程
source: %lld events saved.
zh_hans: 已保存 %lld 条日程
zh_hant: 已儲存 %lld 條行程

# 已填写的内容不会被保存。
source: Unsaved content will be discarded.
zh_hans: 已填写的内容不会被保存。
zh_hant: 已填寫的內容不會被儲存。

# 已复制
source: Copied.
zh_hans: 已复制
zh_hant: 已複製

# 已失效
source: Unavailable
zh_hans: 已失效
zh_hant: 已失效

# 已识别 %lld 项，成功保存 %lld 项： %@
source: %1$lld items identified, %2$lld saved successfully: %3$@
zh_hans: 已识别 %1$lld 项，成功保存 %2$lld 项： %3$@
zh_hant: 已識別 %1$lld 項，成功儲存 %2$lld 項： %3$@

# 当前请求时间
source: Current request time
zh_hans: 当前请求时间
zh_hant: 當前請求時間

# 必填
source: Required
zh_hans: 必填
zh_hant: 必填

# 所属服务商
source: Provider
zh_hans: 所属服务商
zh_hant: 所屬服務商

# 找到 %lld 条日程
source: %lld events found
zh_hans: 找到 %lld 条日程
zh_hant: 找到 %lld 條行程

# 找到多个名为 '%@' 的列表，已选择第一个。
source: Multiple lists named '%@' found. The first one was selected.
zh_hans: 找到多个名为 '%@' 的列表，已选择第一个。
zh_hant: 找到多個名為 '%@' 的列表，已選擇第一個。

# 提取日程时将自动使用以下列表进行分类。
source: Extracted events will be saved into one of these lists.
zh_hans: 提取日程时将自动使用以下列表进行分类。
zh_hant: 提取行程時將自動使用以下列表進行分類。

# 提示词
source: Prompt
zh_hans: 提示词
zh_hant: 提示詞

# 提醒事项访问受限。
source: Reminders access restricted.
zh_hans: 提醒事项访问受限。
zh_hant: 提醒事項存取受限。

# 放弃
source: Discard
zh_hans: 放弃
zh_hant: 放棄

# 放弃编辑？
source: Discard changes?
zh_hans: 放弃编辑？
zh_hant: 放棄編輯？

# 数据解析失败: %@
source: Data parsing failed: %@
zh_hans: 数据解析失败: %@
zh_hant: 資料解析失敗: %@

# 无法保存服务商配置，请检查磁盘空间或文件权限。
source: Unable to save service provider configuration. Please check disk space or file permissions.
zh_hans: 无法保存服务商配置，请检查磁盘空间或文件权限。
zh_hant: 無法儲存服務商配置，請檢查磁碟空間或檔案權限。

# 无法创建自动计划日历: %@
source: Unable to create AutoPlan calendar: %@
zh_hans: 无法创建自动计划日历: %@
zh_hant: 無法建立自動計畫行事曆: %@

# 无法将提取的 JSON 字符串转换为 UTF-8 数据
source: Unable to convert extracted JSON string to UTF-8 data
zh_hans: 无法将提取的 JSON 字符串转换为 UTF-8 数据
zh_hant: 無法將擷取的 JSON 字串轉換為 UTF-8 資料

# 无法打开文件
source: Unable to open file.
zh_hans: 无法打开文件
zh_hant: 無法開啟檔案

# 无法找到可用的日历账户源（如 iCloud），无法创建新日历。
source: No available calendar account source (e.g. iCloud) found. Unable to create a new calendar.
zh_hans: 无法找到可用的日历账户源（如 iCloud），无法创建新日历。
zh_hant: 無法找到可用的行事曆帳號來源（如 iCloud），無法建立新行事曆。

# 无法用默认应用打开自定义提示词文件。
source: Unable to open the custom prompt file with the default application.
zh_hans: 无法用默认应用打开自定义提示词文件。
zh_hant: 無法用預設應用程式開啟自訂提示詞檔案。

# 日历访问受限（可能是家长控制或企业配置）。
source: Calendar access restricted (possibly due to parental controls or enterprise configuration).
zh_hans: 日历访问受限（可能是家长控制或企业配置）。
zh_hant: 行事曆存取受限（可能是家長控制或企業設定）。

# 日期与星期几对照表
source: Date-weekday lookup table
zh_hans: 日期与星期几对照表
zh_hant: 日期與星期幾對照表

# 日程提取
source: Event Extraction
zh_hans: 日程提取
zh_hant: 行程擷取

# 日程提取提示词占位符说明
source: Schedule Extraction Prompt Variables
zh_hans: 日程提取提示词占位符说明
zh_hant: 行程擷取提示詞佔位符說明

# 日程提取提示词模板
source: Template Prompt
zh_hans: 日程提取提示词模板
zh_hant: 日程提取提示詞模板

# 日程提取模型
source: Model
zh_hans: 日程提取模型
zh_hant: 行程擷取模型

# 显示
source: Show
zh_hans: 显示
zh_hant: 顯示

# 暂无可用模型配置。
source: No LLM service provider.
zh_hans: 暂无可用模型配置。
zh_hant: 暫無可用模型配置。

# 暂无模型
source: No models
zh_hans: 暂无模型
zh_hant: 暫無模型

# 暂未使用（值为空）。预留用于注入用户个性化信息。
source: Not yet used (value is empty). Reserved for injecting user personalization information.
zh_hans: 暂未使用（值为空）。预留用于注入用户个性化信息。
zh_hant: 暫未使用（值為空）。預留用於注入使用者個人化資訊。

# 服务商 Logo
source: Provider Logo
zh_hans: 服务商 Logo
zh_hant: 服務商 Logo

# 服务商「%@」的 API Key 未配置
source: API Key for service provider "%@" is not configured.
zh_hans: 服务商「%@」的 API Key 未配置
zh_hant: 服務商「%@」的 API Key 未配置

# 服务商信息
source: Provider Information
zh_hans: 服务商信息
zh_hant: 服務商資訊

# 服务商别名
source: Provider Alias
zh_hans: 服务商别名
zh_hant: 服務商別名

# 服务商名称
source: Provider Name
zh_hans: 服务商名称
zh_hant: 服務商名稱

# 服务商名称已存在
source: Provider name already exists
zh_hans: 服务商名称已存在
zh_hant: 服務商名稱已存在

# 服务器内部错误，请稍后再试
source: Internal server error, please try again later.
zh_hans: 服务器内部错误，请稍后再试
zh_hant: 伺服器內部錯誤，請稍後再試

# 服务器报错 (代码: %lld)
source: Server error (code: %lld)
zh_hans: 服务器报错 (代码: %lld)
zh_hant: 伺服器報錯 (代碼: %lld)

# 未找到可用列表，请检查日历权限后刷新。
source: No list available. Verify calendar permissions and refresh.
zh_hans: 未找到可用列表，请检查日历权限后刷新。
zh_hant: 未找到可用列表，請檢查行事曆權限後重新整理。

# 未找到模型「%@」的配置
source: Configuration for model "%@" not found.
zh_hans: 未找到模型「%@」的配置
zh_hant: 未找到模型「%@」的配置

# 未能识别到任何日程或提醒事项
source: Unable to recognize any events or reminders.
zh_hans: 未能识别到任何日程或提醒事项
zh_hant: 未能識別到任何行程或提醒事項

# 本 App 的作用
source: What can this app do?
zh_hans: 本 App 的作用
zh_hant: 本 App 的作用

# 查看示例
source: Example
zh_hans: 查看示例
zh_hant: 檢視範例

source: Format: ISO 8601 (YYYY-MM-DD HH:MM:SS) Used to infer relative times and judge time reasonableness. **Example of actual filled content**: ``` 2026-05-24 16:30:00. Only indicates the times of current request. ```
zh_hans: 格式：ISO 8601 (YYYY-MM-DD HH:MM:SS) 用于推断相对时间和判断时间合理性。 **实际填充内容示例**： ``` 2026-05-24 16:30:00. Only indicates the times of current request. ```
zh_hant: 格式：ISO 8601 (YYYY-MM-DD HH:MM:SS) 用於推斷相對時間和判斷時間合理性。 **實際填充內容範例**： ``` 2026-05-24 16:30:00. Only indicates the times of current request. ```

# 模型
source: Models
zh_hans: 模型
zh_hant: 模型

# 模型名称
source: Model Name
zh_hans: 模型名称
zh_hant: 模型名稱

# 每周起始日
source: Start of Week
zh_hans: 每周起始日
zh_hant: 每週起始日

# 没有提醒事项访问权限，请在设置中开启。
source: No Reminders access permission. Please enable it in Settings.
zh_hans: 没有提醒事项访问权限，请在设置中开启。
zh_hant: 沒有提醒事項存取權限，請在設定中開啟。

# 没有日历访问权限，请在设置中开启。
source: No Calendar access permission. Please enable it in Settings.
zh_hans: 没有日历访问权限，请在设置中开启。
zh_hant: 沒有行事曆存取權限，請在設定中開啟。

# 测试中...
source: Testing…
zh_hans: 测试中...
zh_hant: 測試中...

# 测试连通性
source: Test connectivity
zh_hans: 测试连通性
zh_hant: 測試連通性

# 添加 LLM 服务商或模型
source: Add LLM Provider or Model
zh_hans: 添加 LLM 服务商或模型
zh_hant: 加入 LLM 服務商或模型

# 添加 LLM 配置
source: Add LLM Configuration
zh_hans: 添加 LLM 配置
zh_hant: 加入 LLM 設定

# 添加描述…
source: Add description…
zh_hans: 添加描述…
zh_hant: 加入描述…

# 添加描述有助于让分类更加准确。
source: Adding descriptions helps improve the accuracy of classification.
zh_hans: 添加描述有助于让分类更加准确。
zh_hant: 加入描述有助於讓分類更加準確。

# 添加服务商
source: Add an LLM provider
zh_hans: 添加服务商
zh_hant: 加入服務商

# 添加模型
source: Add a model
zh_hans: 添加模型
zh_hant: 加入模型

# 清除
source: Clear
zh_hans: 清除
zh_hant: 清除

# 点击更换 Logo
source: Click to change logo.
zh_hans: 点击更换 Logo
zh_hant: 點擊更換 Logo

# 点击查看详细说明
source: Click for details
zh_hans: 点击查看详细说明
zh_hant: 點擊檢視詳細說明

# 点击添加模型，按回车确认
source: Click to add model, press Enter to confirm.
zh_hans: 点击添加模型，按回车确认
zh_hant: 點擊加入模型，按 Enter 確認

# 版本 %@
source: Version %@
zh_hans: 版本 %@
zh_hant: 版本 %@

source: All calendar and reminder lists authorized by the user. The LLM selects a matching list name from these to fill the `list` field. **Example of actual filled content**: ``` Calendar Lists (for type: "event" or "all-day"): - "Work" - "Personal" Reminder Lists (for type: "reminder"): - "To-Do" - "Shopping List" Select a matching list from the choices above for the 'list' field. If none match, leave it blank. ```
zh_hans: 用户授权的所有日历和提醒事项列表。 LLM 从中选择匹配的列表名称填入 `list` 字段。 **实际填充内容示例**： ``` Calendar Lists (for type: "event" or "all-day"): - "工作" - "个人" Reminder Lists (for type: "reminder"): - "待办" - "购物清单" Select a matching list from the choices above for the 'list' field. If none match, leave it blank. ```
zh_hant: 使用者授權的所有行事曆和提醒事項列表。 LLM 從中選擇匹配的列表名稱填入 `list` 欄位。 **實際填充內容範例**： ``` Calendar Lists (for type: "event" or "all-day"): - "工作" - "個人" Reminder Lists (for type: "reminder"): - "待辦" - "購物清單" Select a matching list from the choices above for the 'list' field. If none match, leave it blank. ```

# 用户规则
source: User Instruction
zh_hans: 用户规则
zh_hant: 用戶規則

# 用户身份信息
source: User identity information
zh_hans: 用户身份信息
zh_hant: 使用者身分資訊

# 确定删除服务商「%@」及其所有模型和 API Key 吗？
source: Are you sure you want to delete provider 「%@」 and all its models and API Key?
zh_hans: 确定删除服务商「%@」及其所有模型和 API Key 吗？
zh_hant: 確定刪除服務商「%@」及其所有模型和 API Key 嗎？
